ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/instance/tc1.h
/* ---------------------------------------------------------------------------- */
/*                Microchip Microcontroller Software Support                    */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2021, Microchip Technology Inc.                                */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Microchip's name may not be used to endorse or promote products derived from */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS  */
/* OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES */
/* OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT    */
/* ARE DISCLAIMED. IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT,        */
/* INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES           */
/* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; */
/* LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND  */
/* ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT   */
/* (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF     */
/* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.            */
/* ---------------------------------------------------------------------------- */

#ifndef _PIC32CX_TC1_INSTANCE_
#define _PIC32CX_TC1_INSTANCE_

/* ========== Register definition for TC1 peripheral ========== */
#if (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
  #define REG_TC1_CCR0                   (0x4003C000U) /**< \brief (TC1) Channel Control Register (channel = 0) */
  #define REG_TC1_CMR0                   (0x4003C004U) /**< \brief (TC1) Channel Mode Register (channel = 0) */
  #define REG_TC1_SMMR0                  (0x4003C008U) /**< \brief (TC1) Stepper Motor Mode Register (channel = 0) */
  #define REG_TC1_CV0                    (0x4003C010U) /**< \brief (TC1) Counter Value (channel = 0) */
  #define REG_TC1_RA0                    (0x4003C014U) /**< \brief (TC1) Register A (channel = 0) */
  #define REG_TC1_RB0                    (0x4003C018U) /**< \brief (TC1) Register B (channel = 0) */
  #define REG_TC1_RC0                    (0x4003C01CU) /**< \brief (TC1) Register C (channel = 0) */
  #define REG_TC1_SR0                    (0x4003C020U) /**< \brief (TC1) Interrupt Status Register (channel = 0) */
  #define REG_TC1_IER0                   (0x4003C024U) /**< \brief (TC1) Interrupt Enable Register (channel = 0) */
  #define REG_TC1_IDR0                   (0x4003C028U) /**< \brief (TC1) Interrupt Disable Register (channel = 0) */
  #define REG_TC1_IMR0                   (0x4003C02CU) /**< \brief (TC1) Interrupt Mask Register (channel = 0) */
  #define REG_TC1_EMR0                   (0x4003C030U) /**< \brief (TC1) Extended Mode Register (channel = 0) */
  #define REG_TC1_CSR0                   (0x4003C034U) /**< \brief (TC1) Channel Status Register (channel = 0) */
  #define REG_TC1_SSR0                   (0x4003C038U) /**< \brief (TC1) Safety Status Register (channel = 0) */
  #define REG_TC1_CCR1                   (0x4003C040U) /**< \brief (TC1) Channel Control Register (channel = 1) */
  #define REG_TC1_CMR1                   (0x4003C044U) /**< \brief (TC1) Channel Mode Register (channel = 1) */
  #define REG_TC1_SMMR1                  (0x4003C048U) /**< \brief (TC1) Stepper Motor Mode Register (channel = 1) */
  #define REG_TC1_CV1                    (0x4003C050U) /**< \brief (TC1) Counter Value (channel = 1) */
  #define REG_TC1_RA1                    (0x4003C054U) /**< \brief (TC1) Register A (channel = 1) */
  #define REG_TC1_RB1                    (0x4003C058U) /**< \brief (TC1) Register B (channel = 1) */
  #define REG_TC1_RC1                    (0x4003C05CU) /**< \brief (TC1) Register C (channel = 1) */
  #define REG_TC1_SR1                    (0x4003C060U) /**< \brief (TC1) Interrupt Status Register (channel = 1) */
  #define REG_TC1_IER1                   (0x4003C064U) /**< \brief (TC1) Interrupt Enable Register (channel = 1) */
  #define REG_TC1_IDR1                   (0x4003C068U) /**< \brief (TC1) Interrupt Disable Register (channel = 1) */
  #define REG_TC1_IMR1                   (0x4003C06CU) /**< \brief (TC1) Interrupt Mask Register (channel = 1) */
  #define REG_TC1_EMR1                   (0x4003C070U) /**< \brief (TC1) Extended Mode Register (channel = 1) */
  #define REG_TC1_CSR1                   (0x4003C074U) /**< \brief (TC1) Channel Status Register (channel = 1) */
  #define REG_TC1_SSR1                   (0x4003C078U) /**< \brief (TC1) Safety Status Register (channel = 1) */
  #define REG_TC1_CCR2                   (0x4003C080U) /**< \brief (TC1) Channel Control Register (channel = 2) */
  #define REG_TC1_CMR2                   (0x4003C084U) /**< \brief (TC1) Channel Mode Register (channel = 2) */
  #define REG_TC1_SMMR2                  (0x4003C088U) /**< \brief (TC1) Stepper Motor Mode Register (channel = 2) */
  #define REG_TC1_CV2                    (0x4003C090U) /**< \brief (TC1) Counter Value (channel = 2) */
  #define REG_TC1_RA2                    (0x4003C094U) /**< \brief (TC1) Register A (channel = 2) */
  #define REG_TC1_RB2                    (0x4003C098U) /**< \brief (TC1) Register B (channel = 2) */
  #define REG_TC1_RC2                    (0x4003C09CU) /**< \brief (TC1) Register C (channel = 2) */
  #define REG_TC1_SR2                    (0x4003C0A0U) /**< \brief (TC1) Interrupt Status Register (channel = 2) */
  #define REG_TC1_IER2                   (0x4003C0A4U) /**< \brief (TC1) Interrupt Enable Register (channel = 2) */
  #define REG_TC1_IDR2                   (0x4003C0A8U) /**< \brief (TC1) Interrupt Disable Register (channel = 2) */
  #define REG_TC1_IMR2                   (0x4003C0ACU) /**< \brief (TC1) Interrupt Mask Register (channel = 2) */
  #define REG_TC1_EMR2                   (0x4003C0B0U) /**< \brief (TC1) Extended Mode Register (channel = 2) */
  #define REG_TC1_CSR2                   (0x4003C0B4U) /**< \brief (TC1) Channel Status Register (channel = 2) */
  #define REG_TC1_SSR2                   (0x4003C0B8U) /**< \brief (TC1) Safety Status Register (channel = 2) */
  #define REG_TC1_BCR                    (0x4003C0C0U) /**< \brief (TC1) Block Control Register */
  #define REG_TC1_BMR                    (0x4003C0C4U) /**< \brief (TC1) Block Mode Register */
  #define REG_TC1_QIER                   (0x4003C0C8U) /**< \brief (TC1) QDEC Interrupt Enable Register */
  #define REG_TC1_QIDR                   (0x4003C0CCU) /**< \brief (TC1) QDEC Interrupt Disable Register */
  #define REG_TC1_QIMR                   (0x4003C0D0U) /**< \brief (TC1) QDEC Interrupt Mask Register */
  #define REG_TC1_QISR                   (0x4003C0D4U) /**< \brief (TC1) QDEC Interrupt Status Register */
  #define REG_TC1_FMR                    (0x4003C0D8U) /**< \brief (TC1) Fault Mode Register */
  #define REG_TC1_QSR                    (0x4003C0DCU) /**< \brief (TC1) QDEC Status Register */
  #define REG_TC1_WPMR                   (0x4003C0E4U) /**< \brief (TC1) Write Protection Mode Register */
  #define REG_TC1_RPR                    (0x4003C100U) /**< \brief (TC1) Receive Pointer Register */
  #define REG_TC1_RCR                    (0x4003C104U) /**< \brief (TC1) Receive Counter Register */
  #define REG_TC1_RNPR                   (0x4003C110U) /**< \brief (TC1) Receive Next Pointer Register */
  #define REG_TC1_RNCR                   (0x4003C114U) /**< \brief (TC1) Receive Next Counter Register */
  #define REG_TC1_PTCR                   (0x4003C120U) /**< \brief (TC1) Transfer Control Register */
  #define REG_TC1_PTSR                   (0x4003C124U) /**< \brief (TC1) Transfer Status Register */
  #define REG_TC1_PWPMR                  (0x4003C128U) /**< \brief (TC1) Write Protection Mode Register */
#else
  #define REG_TC1_CCR0  (*(__O  uint32_t*)0x4003C000U) /**< \brief (TC1) Channel Control Register (channel = 0) */
  #define REG_TC1_CMR0  (*(__IO uint32_t*)0x4003C004U) /**< \brief (TC1) Channel Mode Register (channel = 0) */
  #define REG_TC1_SMMR0 (*(__IO uint32_t*)0x4003C008U) /**< \brief (TC1) Stepper Motor Mode Register (channel = 0) */
  #define REG_TC1_CV0   (*(__I  uint32_t*)0x4003C010U) /**< \brief (TC1) Counter Value (channel = 0) */
  #define REG_TC1_RA0   (*(__IO uint32_t*)0x4003C014U) /**< \brief (TC1) Register A (channel = 0) */
  #define REG_TC1_RB0   (*(__IO uint32_t*)0x4003C018U) /**< \brief (TC1) Register B (channel = 0) */
  #define REG_TC1_RC0   (*(__IO uint32_t*)0x4003C01CU) /**< \brief (TC1) Register C (channel = 0) */
  #define REG_TC1_SR0   (*(__I  uint32_t*)0x4003C020U) /**< \brief (TC1) Interrupt Status Register (channel = 0) */
  #define REG_TC1_IER0  (*(__O  uint32_t*)0x4003C024U) /**< \brief (TC1) Interrupt Enable Register (channel = 0) */
  #define REG_TC1_IDR0  (*(__O  uint32_t*)0x4003C028U) /**< \brief (TC1) Interrupt Disable Register (channel = 0) */
  #define REG_TC1_IMR0  (*(__I  uint32_t*)0x4003C02CU) /**< \brief (TC1) Interrupt Mask Register (channel = 0) */
  #define REG_TC1_EMR0  (*(__IO uint32_t*)0x4003C030U) /**< \brief (TC1) Extended Mode Register (channel = 0) */
  #define REG_TC1_CSR0  (*(__I  uint32_t*)0x4003C034U) /**< \brief (TC1) Channel Status Register (channel = 0) */
  #define REG_TC1_SSR0  (*(__I  uint32_t*)0x4003C038U) /**< \brief (TC1) Safety Status Register (channel = 0) */
  #define REG_TC1_CCR1  (*(__O  uint32_t*)0x4003C040U) /**< \brief (TC1) Channel Control Register (channel = 1) */
  #define REG_TC1_CMR1  (*(__IO uint32_t*)0x4003C044U) /**< \brief (TC1) Channel Mode Register (channel = 1) */
  #define REG_TC1_SMMR1 (*(__IO uint32_t*)0x4003C048U) /**< \brief (TC1) Stepper Motor Mode Register (channel = 1) */
  #define REG_TC1_CV1   (*(__I  uint32_t*)0x4003C050U) /**< \brief (TC1) Counter Value (channel = 1) */
  #define REG_TC1_RA1   (*(__IO uint32_t*)0x4003C054U) /**< \brief (TC1) Register A (channel = 1) */
  #define REG_TC1_RB1   (*(__IO uint32_t*)0x4003C058U) /**< \brief (TC1) Register B (channel = 1) */
  #define REG_TC1_RC1   (*(__IO uint32_t*)0x4003C05CU) /**< \brief (TC1) Register C (channel = 1) */
  #define REG_TC1_SR1   (*(__I  uint32_t*)0x4003C060U) /**< \brief (TC1) Interrupt Status Register (channel = 1) */
  #define REG_TC1_IER1  (*(__O  uint32_t*)0x4003C064U) /**< \brief (TC1) Interrupt Enable Register (channel = 1) */
  #define REG_TC1_IDR1  (*(__O  uint32_t*)0x4003C068U) /**< \brief (TC1) Interrupt Disable Register (channel = 1) */
  #define REG_TC1_IMR1  (*(__I  uint32_t*)0x4003C06CU) /**< \brief (TC1) Interrupt Mask Register (channel = 1) */
  #define REG_TC1_EMR1  (*(__IO uint32_t*)0x4003C070U) /**< \brief (TC1) Extended Mode Register (channel = 1) */
  #define REG_TC1_CSR1  (*(__I  uint32_t*)0x4003C074U) /**< \brief (TC1) Channel Status Register (channel = 1) */
  #define REG_TC1_SSR1  (*(__I  uint32_t*)0x4003C078U) /**< \brief (TC1) Safety Status Register (channel = 1) */
  #define REG_TC1_CCR2  (*(__O  uint32_t*)0x4003C080U) /**< \brief (TC1) Channel Control Register (channel = 2) */
  #define REG_TC1_CMR2  (*(__IO uint32_t*)0x4003C084U) /**< \brief (TC1) Channel Mode Register (channel = 2) */
  #define REG_TC1_SMMR2 (*(__IO uint32_t*)0x4003C088U) /**< \brief (TC1) Stepper Motor Mode Register (channel = 2) */
  #define REG_TC1_CV2   (*(__I  uint32_t*)0x4003C090U) /**< \brief (TC1) Counter Value (channel = 2) */
  #define REG_TC1_RA2   (*(__IO uint32_t*)0x4003C094U) /**< \brief (TC1) Register A (channel = 2) */
  #define REG_TC1_RB2   (*(__IO uint32_t*)0x4003C098U) /**< \brief (TC1) Register B (channel = 2) */
  #define REG_TC1_RC2   (*(__IO uint32_t*)0x4003C09CU) /**< \brief (TC1) Register C (channel = 2) */
  #define REG_TC1_SR2   (*(__I  uint32_t*)0x4003C0A0U) /**< \brief (TC1) Interrupt Status Register (channel = 2) */
  #define REG_TC1_IER2  (*(__O  uint32_t*)0x4003C0A4U) /**< \brief (TC1) Interrupt Enable Register (channel = 2) */
  #define REG_TC1_IDR2  (*(__O  uint32_t*)0x4003C0A8U) /**< \brief (TC1) Interrupt Disable Register (channel = 2) */
  #define REG_TC1_IMR2  (*(__I  uint32_t*)0x4003C0ACU) /**< \brief (TC1) Interrupt Mask Register (channel = 2) */
  #define REG_TC1_EMR2  (*(__IO uint32_t*)0x4003C0B0U) /**< \brief (TC1) Extended Mode Register (channel = 2) */
  #define REG_TC1_CSR2  (*(__I  uint32_t*)0x4003C0B4U) /**< \brief (TC1) Channel Status Register (channel = 2) */
  #define REG_TC1_SSR2  (*(__I  uint32_t*)0x4003C0B8U) /**< \brief (TC1) Safety Status Register (channel = 2) */
  #define REG_TC1_BCR   (*(__O  uint32_t*)0x4003C0C0U) /**< \brief (TC1) Block Control Register */
  #define REG_TC1_BMR   (*(__IO uint32_t*)0x4003C0C4U) /**< \brief (TC1) Block Mode Register */
  #define REG_TC1_QIER  (*(__O  uint32_t*)0x4003C0C8U) /**< \brief (TC1) QDEC Interrupt Enable Register */
  #define REG_TC1_QIDR  (*(__O  uint32_t*)0x4003C0CCU) /**< \brief (TC1) QDEC Interrupt Disable Register */
  #define REG_TC1_QIMR  (*(__I  uint32_t*)0x4003C0D0U) /**< \brief (TC1) QDEC Interrupt Mask Register */
  #define REG_TC1_QISR  (*(__I  uint32_t*)0x4003C0D4U) /**< \brief (TC1) QDEC Interrupt Status Register */
  #define REG_TC1_FMR   (*(__IO uint32_t*)0x4003C0D8U) /**< \brief (TC1) Fault Mode Register */
  #define REG_TC1_QSR   (*(__I  uint32_t*)0x4003C0DCU) /**< \brief (TC1) QDEC Status Register */
  #define REG_TC1_WPMR  (*(__IO uint32_t*)0x4003C0E4U) /**< \brief (TC1) Write Protection Mode Register */
  #define REG_TC1_RPR   (*(__IO uint32_t*)0x4003C100U) /**< \brief (TC1) Receive Pointer Register */
  #define REG_TC1_RCR   (*(__IO uint32_t*)0x4003C104U) /**< \brief (TC1) Receive Counter Register */
  #define REG_TC1_RNPR  (*(__IO uint32_t*)0x4003C110U) /**< \brief (TC1) Receive Next Pointer Register */
  #define REG_TC1_RNCR  (*(__IO uint32_t*)0x4003C114U) /**< \brief (TC1) Receive Next Counter Register */
  #define REG_TC1_PTCR  (*(__O  uint32_t*)0x4003C120U) /**< \brief (TC1) Transfer Control Register */
  #define REG_TC1_PTSR  (*(__I  uint32_t*)0x4003C124U) /**< \brief (TC1) Transfer Status Register */
  #define REG_TC1_PWPMR (*(__IO uint32_t*)0x4003C128U) /**< \brief (TC1) Write Protection Mode Register */
#endif /* (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#endif /* _PIC32CX_TC1_INSTANCE_ */
